# 5. Напишите программу, которая принимает на вход координаты двух точек 
# и находит расстояние между ними в 2D пространстве.
# in
# - 3
# - 6
# - 2
# - 1

# out
# 5.099

x_a = int(input("x1 = "))
x_b = int(input("x2 = "))
y_a = int(input("y1 = "))
y_b = int(input("y2 = "))

F = float(((x_b - x_a) ** 2 + (y_b - y_a) ** 2) ** 0.5)

print("{:.4f}".format(F))


